[
  {
    "id": 0,
    "img": "/assets/portaleTrasparenza.png",
    "title": "",
    "content": "Portale web sviluppato per permettere agli utenti di verificare la conformità di un sito web rispetto agli standard legali e normativi. L'interfaccia intuitiva consente un'analisi automatica e approfondita, assicurando che i siti siano conformi e sicuri, migliorando l'esperienza utente e la gestione delle normative digitali."
  },
  {
    "id": 1,
    "title": "Funzionamento del portale\n (ancora in fase di sviluppo)\n",
    "content": "\n\nIl funzionamento del nostro portale è semplice ed efficiente.\nL'utente inserisce l'URL del sito web che desidera verificare e il sistema invia il link al backend.\nQui, un algoritmo avanzato sviluppato in Node.js esegue uno scraping completo del sito, esplorando ogni pagina per raccogliere e analizzare le informazioni necessarie per determinare la conformità del sito alle normative.\n\nDurante il processo, vengono estratti dati rilevanti come l'indirizzo (sede legale) tramite un modello NLP personalizzato che abbiamo addestrato utilizzando un ampio database degli indirizzi italiani.\nQuesto modello è in grado di riconoscere gli indirizzi in qualsiasi formato, garantendo precisione.\nOltre all'indirizzo, il sistema raccoglie altre informazioni chiave, come i PDF dei bilanci, la partita IVA, il codice fiscale, i numeri di telefono e altro ancora.\n\nTutti i dati estratti vengono poi validati e inviati al frontend, dove vengono presentati all'utente in due tabelle chiare e facilmente comprensibili.\nLe informazioni possono essere visualizzate e anche esportate in formato Excel o PDF, per una consultazione e gestione più comoda.\n ps: Nel portale è anche presente un tour virtuale creato in 3d e con una guida che spiega il funzionamento nel dettaglio."
  },
  {
    "id": 2,
    "title": "Tecnologie Utilizzate per lo Sviluppo del Gestionale",
    "content": "Frontend 🌐\n- HTML, CSS, JavaScript\n- Tailwind: framework utilizzato per il design di alcuni elementi \n- Flowbite: Una libreria UI che si integra facilmente con Tailwind\n- Figma: utilizzato per creare dei frame da inserire nel sito \n- Spline: Strumento di modellazione 3D per creare esperienze immersive e tour interattivi nel sito.\n\nBackend 💻\n- PM2: Un gestore di processi per far in modo che il server sia sempre attivo e ottimizzato.\n- Express: utilizzato la creazione del server web e per le richieste API. \n- Node.js\n- Axios: Una libreria JavaScript per fare richieste HTTP asincrone .\n- Cheerio: Una libreria per lo scraping del contenuto HTML.\n- Python con Spacy: Una libreria Python avanzata per il Natural Language Processing (NLP), utilizzata per l'analisi e l'estrazione di dati dal testo.\n- GPU: Utilizzo di unità di elaborazione grafica per accelerare l'addestramento del modello NLP, garantendo prestazioni ottimali.\n\n Gestione Dati e Sicurezza 🔒\n- MySQL2: Una versione ottimizzata del driver MySQL per Node.js, che consente una gestione efficiente dei dati.\n- File .env: utilizzato per garantire la sicurezza dei dati sensibili.\n- HTTPS e Reverse Proxy: Un sistema che consente di filtrare e indirizzare le richieste dal frontend al backend, permettendo l'accesso solo da fonti autorizzate."
  },
  {
    "id": 3,
    "title": "Competenze Acquisite",
    "content": "Durante lo sviluppo di questo progetto, ho acquisito competenze avanzate in Natural Language Processing (NLP), gestione backend, sicurezza del sito e ottimizzazione delle performance.\n\n1. NLP e Creazione di Modelli: Ho sviluppato e addestrato un modello NLP personalizzato per l'estrazione di informazioni come indirizzi e bilanci, utilizzando spaCy e l'addestramento su GPU. Questo mi ha permesso di perfezionare le tecniche di analisi linguistica per lavorare con dati complessi.\n\n2. Gestione Backend e Sicurezza: Ho costruito una solida architettura backend con Node.js ed Express, implementando misure di sicurezza come HTTPS e un reverse proxy per proteggere il sito. Ho anche utilizzato MySQL per gestire i dati in modo sicuro.\n\n3. Gestione delle Richieste e Performance: Ho ottimizzato la gestione delle richieste simultanee utilizzando Axios e Cheerio per garantire alte performance durante lo scraping e l'analisi dei dati. Ho anche gestito i processi di backend con PM2 per mantenere il sistema stabile e veloce.\n\n4. Frontend Dinamico e Interattivo: Ho creato interfacce utente reattive utilizzando React e Tailwind CSS, integrando funzionalità interattive come un tour 3D con Spline, migliorando l'esperienza utente.\n\nIn sintesi, questo progetto mi ha permesso di sviluppare competenze in analisi dei dati, sicurezza informatica, e ottimizzazione delle performance, rafforzando la mia capacità di progettare soluzioni scalabili e sicure."
  }
]
